ririyeye/co_mcu/bsp/Firmware/GD32E11x_standard_peripheral/Include/gd32e11x_usart.h
/* USART interrupt enable or disable */
typedef enum {
    /* interrupt in CTL0 register */
    USART_INT_PERR = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 8U),        /*!< parity error interrupt */
    USART_INT_TBE = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 7U),         /*!< transmitter buffer empty interrupt */
    USART_INT_TC = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 6U),          /*!< transmission complete interrupt */
    USART_INT_RBNE = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 5U),        /*!< read data buffer not empty interrupt and overrun error interrupt */
    USART_INT_IDLE = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 4U),        /*!< IDLE line detected interrupt */
    /* interrupt in CTL1 register */
    USART_INT_LBD = USART_REGIDX_BIT(USART_CTL1_REG_OFFSET, 6U),         /*!< LIN break detected interrupt */
    /* interrupt in CTL2 register */
    USART_INT_CTS = USART_REGIDX_BIT(USART_CTL2_REG_OFFSET, 10U),        /*!< CTS interrupt */
    USART_INT_ERR = USART_REGIDX_BIT(USART_CTL2_REG_OFFSET, 0U),         /*!< error interrupt */
    /* interrupt in CTL3 register */
    USART_INT_EB = USART_REGIDX_BIT(USART_CTL3_REG_OFFSET, 5U),          /*!< end of block interrupt */
    USART_INT_RT = USART_REGIDX_BIT(USART_CTL3_REG_OFFSET, 4U)           /*!< receive timeout interrupt */
} usart_interrupt_enum;

/* configure USART invert */
typedef enum {
    /* data bit level inversion */
    USART_DINV_ENABLE,                                                   /*!< data bit level inversion */
    USART_DINV_DISABLE,                                                  /*!< data bit level not inversion */
    /* TX pin level inversion */
    USART_TXPIN_ENABLE,                                                  /*!< TX pin level inversion */
    USART_TXPIN_DISABLE,                                                 /*!< TX pin level not inversion */
    /* RX pin level inversion */
    USART_RXPIN_ENABLE,                                                  /*!< RX pin level inversion */
    USART_RXPIN_DISABLE                                                  /*!< RX pin level not inversion */
} usart_invert_enum;

/* configure USART receiver */
#define CTL0_REN(regval)              (BIT(2) & ((uint32_t)(regval) << 2))
#define USART_RECEIVE_ENABLE          CTL0_REN(1)                        /*!< enable receiver */
#define USART_RECEIVE_DISABLE         CTL0_REN(0)                        /*!< disable receiver */

/* configure USART transmitter */
#define CTL0_TEN(regval)              (BIT(3) & ((uint32_t)(regval) << 3))
#define USART_TRANSMIT_ENABLE         CTL0_TEN(1)                        /*!< enable transmitter */
#define USART_TRANSMIT_DISABLE        CTL0_TEN(0)                        /*!< disable transmitter */

/* USART parity bits definitions */
#define CTL0_PM(regval)               (BITS(9,10) & ((uint32_t)(regval) << 9))
#define USART_PM_NONE                 CTL0_PM(0)                         /*!< no parity */
#define USART_PM_EVEN                 CTL0_PM(2)                         /*!< even parity */
#define USART_PM_ODD                  CTL0_PM(3)                         /*!< odd parity */

/* USART wakeup method in mute mode */
#define CTL0_WM(regval)               (BIT(11) & ((uint32_t)(regval) << 11))
#define USART_WM_IDLE                 CTL0_WM(0)                         /*!< idle line */
#define USART_WM_ADDR                 CTL0_WM(1)                         /*!< address match */

/* USART word length definitions */
#define CTL0_WL(regval)               (BIT(12) & ((uint32_t)(regval) << 12))
#define USART_WL_8BIT                 CTL0_WL(0)                         /*!< 8 bits */
#define USART_WL_9BIT                 CTL0_WL(1)                         /*!< 9 bits */

/* USART stop bits definitions */
#define CTL1_STB(regval)              (BITS(12,13) & ((uint32_t)(regval) << 12))
#define USART_STB_1BIT                CTL1_STB(0)                        /*!< 1 bit */
#define USART_STB_0_5BIT              CTL1_STB(1)                        /*!< 0.5 bit */
#define USART_STB_2BIT                CTL1_STB(2)                        /*!< 2 bits */
#define USART_STB_1_5BIT              CTL1_STB(3)                        /*!< 1.5 bits */

/* USART LIN break frame length */
#define CTL1_LBLEN(regval)            (BIT(5) & ((uint32_t)(regval) << 5))
#define USART_LBLEN_10B               CTL1_LBLEN(0)                      /*!< 10 bits */
#define USART_LBLEN_11B               CTL1_LBLEN(1)                      /*!< 11 bits */

/* USART CK length */
#define CTL1_CLEN(regval)             (BIT(8) & ((uint32_t)(regval) << 8))
#define USART_CLEN_NONE               CTL1_CLEN(0)                       /*!< there are 7 CK pulses for an 8 bit frame and 8 CK pulses for a 9 bit frame */
#define USART_CLEN_EN                 CTL1_CLEN(1)                       /*!< there are 8 CK pulses for an 8 bit frame and 9 CK pulses for a 9 bit frame */

/* USART clock phase */
#define CTL1_CPH(regval)              (BIT(9) & ((uint32_t)(regval) << 9))
#define USART_CPH_1CK                 CTL1_CPH(0)                        /*!< first clock transition is the first data capture edge */
#define USART_CPH_2CK                 CTL1_CPH(1)                        /*!< second clock transition is the first data capture edge */

/* USART clock polarity */
#define CTL1_CPL(regval)              (BIT(10) & ((uint32_t)(regval) << 10))
#define USART_CPL_LOW                 CTL1_CPL(0)                        /*!< steady low value on CK pin */
#define USART_CPL_HIGH                CTL1_CPL(1)                        /*!< steady high value on CK pin */

/* configure USART DMA */
#define CLT2_RECEIVE_DMAEN(regval)    (BIT(6) & ((uint32_t)(regval) << 6))
#define CTL2_TRANSMIT_DMAEN(regval)   (BIT(7) & ((uint32_t)(regval) << 7))
#define USART_RECEIVE_DMA_ENABLE      CLT2_RECEIVE_DMAEN(1)              /* enable DMA request for reception */
#define USART_RECEIVE_DMA_DISABLE     CLT2_RECEIVE_DMAEN(0)              /* disable DMA request for reception */
#define USART_TRANSMIT_DMA_ENABLE     CTL2_TRANSMIT_DMAEN(1)             /* enable DMA request for transmission */
#define USART_TRANSMIT_DMA_DISABLE    CTL2_TRANSMIT_DMAEN(0)             /* disable DMA request for transmission */

/* configure USART RTS */
#define CLT2_RTSEN(regval)            (BIT(8) & ((uint32_t)(regval) << 8))
#define USART_RTS_ENABLE              CLT2_RTSEN(1)                      /*!< enable RTS  */
#define USART_RTS_DISABLE             CLT2_RTSEN(0)                      /*!< disable RTS */

/* configure USART CTS */
#define CLT2_CTSEN(regval)            (BIT(9) & ((uint32_t)(regval) << 9))
#define USART_CTS_ENABLE              CLT2_CTSEN(1)                      /*!< enable CTS */
#define USART_CTS_DISABLE             CLT2_CTSEN(0)                      /*!< disable CTS  */

